cat = False
phonee = False
print("Привет, странник. "
      "Как тебя зовут?")
name = str(input("Введи свое имя: "))
print ("Ну и имя... Как в здравом уме можно так назвать человека?")
import time
time.sleep(1.5)
print ("Ладно... Добро пожаловать, ", name, ".")
time.sleep(1.5)
print ("Ты меня найдешь. Я буду рядом")
time.sleep(1.5)
print ("Обещаю.")
time.sleep(2)
print ("Вас ударяют и вы теряете сознание")
time.sleep(2)
text1 =("""
  ________      ___    ___ ________  _______   ________  ________  ___  ___  ________   ___  __           
|\   ____\    |\  \  /  /|\   __  \|\  ___ \ |\   __  \|\   __  \|\  \|\  \|\   ___  \|\  \|\  \         
\ \  \___|    \ \  \/  / | \  \|\ /\ \   __/|\ \  \|\  \ \  \|\  \ \  \\\  \ \  \\ \  \ \  \/  /|_       
 \ \  \        \ \    / / \ \   __  \ \  \_|/_\ \   _  _\ \   ____\ \  \\\  \ \  \\ \  \ \   ___  \      
  \ \  \____    \/  /  /   \ \  \|\  \ \  \_|\ \ \  \\  \\ \  \___|\ \  \\\  \ \  \\ \  \ \  \\ \  \     
   \ \_______\__/  / /      \ \_______\ \_______\ \__\\ _\\ \__\    \ \_______\ \__\\ \__\ \__\\ \__\    
    \|_______|\___/ /        \|_______|\|_______|\|__|\|__|\|__|     \|_______|\|__| \|__|\|__| \|__|    
             \|___|/                                                                                     
                                                                                                         
                                                                                                         
 ________  ________    _____  ________                                                                   
|\_____  \|\   __  \  / __  \|\   __  \                                                                  
\|____|\ /\ \  \|\  \|\/_|\  \ \  \|\  \                                                                 
      \|\  \ \  \\\  \|/ \ \  \ \   __  \                                                                
     __\_\  \ \  \\\  \   \ \  \ \  \|\  \                                                               
    |\_______\ \_______\   \ \__\ \_______\                                                              
    \|_______|\|_______|    \|__|\|_______|                                                                                                                                                                  
                                                               
                                                                                                                                                                                                                                                                        
""")
for letter in text1:
    print(letter, end="")
    time.sleep(0.005)
time.sleep(1.5)
print ("Вы просыпаетесь в комнате с желтыми стенами и смешными нарисованными на них картинками")
time.sleep(1.5)
print ("Это выглядит очень крипово и смешно")
time.sleep(1.5)
print ("Скорее смешно...")
time.sleep(1.5)
print ("Лол, куда я попал")
time.sleep(1.5)
print ("Вы встаете и осматриваетесь.")
print("Вы видите две двери.")
print("На левой двери написано 'Вход запрещен.'")
print("На правой двери написано 'Лол, вход разрешен, не идите налево (вы сломаете игру)'.")
time.sleep(3)
def start_1():
    print ("Куда же мне идти?")
    print ("1 –– Налево")
    print ("2 –– Направо")
    c1 = int(input())
    if  c1 == 1:
        print ("Воу...Тебя же предупредили ")
        time.sleep(1.5)
        print ("Либо ты не умеешь читать читать, либо ты идиот ")
        time.sleep(1.5)
        print ('Мир начинает распадаться на двоичный код, вас выталкивает из комнаты.')
        time.sleep(1.5)
        print ('В этот раз надеюсь вы сделаете правильный выбор, вы пойдете направо. ')
        time.sleep(1.5)
    if c1 == 2:
        print ("Вы –– красавчик")
        time.sleep(1.5)
        print ("Вы -– супер")
        time.sleep(1.5)
        print ("Вы делаете правильные выборы.")
        time.sleep(1.5)
        print  ("Спасибо.")
start_1()
time.sleep(3)
print("Вы заходите в комнату и подходите к зеркалу")
time.sleep(1.5)
print("О боже....")
time.sleep(1.5)
print("""
                      _____ 
                   ,-'     `._ 
                 ,'           `.        ,-. 
               ,'               \       ),.\ 
     ,.       /                  \     /(  \; 
    /'\\     ,o.        ,ooooo.   \  ,'  `-') 
    )) )`. d8P|Y8.    ,8P|||||Y8.  `'  .--"'
   (`-'   `Y'  `Y8    dP       `'     /
    `----.(   __ `    ,' ,---.       (
           ),--.`.   (  ;,---.        )
          / \O_,' )   \  \O_,'        |
         ;  `-- ,'       `---'        |
         |    -'         `.           |
        _;    ,            )          :
     _.'|     `.:._   ,.::0 `..       |
  --'   |   .'     {-}         `      |`. 
        |  :;      :   :     _.       |`.`.-'--. 
        |  ' .     :   :__.,'|/       |  \ 
        `     \--.__.-'|_|_|-/        /   ) 
         \     \_   `--^"__,'        ,    | 
         ;  `    `--^---'          ,'     | 
          \  `                    /      / 
           \   `    _ _          / 
            \           `       / 
             \           '    ,' 
              `.       ,   _,' 
                `-.___.---' 


""")
print("ЧТО ПРОИЗОШЛО????")
time.sleep(1.5)
print('Вы выглядите как чудовище')
time.sleep(1.5)
print('На самом деле я просто скопировал ASCII арт шрека.')
time.sleep(1.5)
print('Играйте и живите с этим дальше.')
time.sleep(1.5)
print("Вы в ужасе. Вы замечаете окно и подбегаете к нему")
time.sleep(1.5)
print("Где....")
time.sleep(1.5)
print('...')
time.sleep(1.5)
print("Где я?")
time.sleep(1.5)
print('На подоконнике вы находите чей-то телефон. Вы включаете его')
time.sleep(1.5)
print("Как только телефон включается вам поступает звонок")
time.sleep(1.5)
print('Ответить на телефон?')
time.sleep(1.5)
print("1 –– Да")
print("2 –– Нет")
seek = int(input())
if seek == 1:
    time.sleep(1.5)
    print("Вы принимаете звонок.")
    time.sleep(1.5)
    print("Алооо..")
    time.sleep(1.5)
    print("нууу")
    time.sleep(1.5)
    print("это")
    time.sleep(1.5)
    print("Что?")
    time.sleep(1.5)
    print("пока")
    time.sleep(1.5)
    print("Этот разговор был абсолютно бесмыссленен")
    time.sleep(1.5)
    print("Вы чувствуете себя глупо.")
    time.sleep(1.5)
if seek == 2:
    time.sleep(1.5)
    print("Вы не отвечаете на вызов")
    time.sleep(1.5)
    print('Не знаю почему, но вы решили на него не отвечать.')
    time.sleep(1.5)
    print('¯\_(ツ)_/¯')
print("Взять телефон с собой?")
time.sleep(1.5)
print("1 –– Да")
print("2 –– Нет")
phone = int(input())
if phone == 1:
    print("Вы взяли телефон.")
    phonee = True
if phone == 2:
    time.sleep(1.5)
    print('Вы решили не брать телефон.')
    time.sleep(1.5)
    print('И никто не знает чем вы руководствовались. С ним бы было интереснее и вы это знаете')
    time.sleep(1.5)
    print('¯\_(ツ)_/¯')
    phonee = False
time.sleep(1.5)
print("Вы замечаете пожарную лесницу")
time.sleep(1.5)
print('Но в комнате есть еще одна дверь. Интересно, куда она ведет.. В ней точно что-то есть!')
time.sleep(1.5)
print("Куда пойдем?")
time.sleep(1.5)
print("1 ––  На улицу")
time.sleep(1.5)
print("2 –– В комнату")
c2 = int(input())

def ending():
    print('Ухх... Ну и денек выдался')
    time.sleep(1.5)
    print('Какой такой денек?')
    time.sleep(1.5)
    print('Что? Кто это?')
    time.sleep(1.5)
    print('Тот кто тебя создал. И игру. Ну типа это такой крутой поворот. Шаришь?')
    time.sleep(1.5)
    print('Ну вроде. Ну так тогда раз мы встретились, может вернешь меня обратно, в 2018?')
    time.sleep(1.5)
    print('Ну тогда попрощайся с игроком')
    time.sleep(1.5)
    print('Ой. Точно. Пока, Игрок.')
    time.sleep(1.5)
    print('Попрощайся с гг. Напиши "Пока"')
    bye = str(input())
    if bye == ("Пока") or ("пока"):
        time.sleep(1.5)
        print('и тебе пока! удачи.')
        time.sleep(1.5)
        text=('''
      _______ _    _ ______   ______ _   _ _  
 |__   __| |  | |  ____| |  ____| \ | |  __ \ 
    | |  | |__| | |__    | |__  |  \| | |  | |
    | |  |  __  |  __|   |  __| | . ` | |  | |
    | |  | |  | | |____  | |____| |\  | |__| |
    |_|  |_|  |_|______| |______|_| \_|_____/ 
    ''')
        for letter in text:
            print(letter, end='')
            time.sleep(0.01)
        if phonee == True:
            time.sleep(1.5)
            print("А вот то что, ты сфотографировали")
            time.sleep(1.5)
            print("""
                      .|
                       | |
                       |'|            ._____
               ___    |  |            |.   |' .---"|
       _    .-'   '-. |  |     .--'|  ||   | _|    |
    .-'|  _.|  |    ||   '-__  |   |  |    ||      |
    |' | |.    |    ||       | |   |  |    ||      |
 ___|  '-'     '    ""       '-'   '-.'    '`      |____
 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
         """)
        time.sleep(5)
        exit()
    else:
        exit()
    for letter in text:
        print(letter, end="")
        time.sleep(0.01)
def ulica():
    print("Вы выходите на улицу.")
    time.sleep(1.5)
    print("Тут довольно круто.")
    time.sleep(1.5)
    print('Вам нравится..')
    time.sleep(1.5)
    print('Вы хотите это сфотографировать.')
    if phonee == True:
        print("Вы фотографируете и понимаете, что вы плохой фотограф")
        time.sleep(2)
        print("Вы злитесь.")
        time.sleep(1.5)
        print("ಠ_ಠ")
        time.sleep(1.5)
        print('Но все же вы сохраняеете фотку.')
        time.sleep(2)
    else:
        print("Но вы вспоминаете, что вы решили не подбирать телефон. Вы же очень интересный человек.")
        time.sleep(1.5)
    print("Так держать.")
    time.sleep(1.5)
    print('Вы идете дальше. О НЕТ! На вас нападает киберпанк бомж')
    time.sleep(1.5)
    print('Хотя вы выглядите хуже его..')
    time.sleep(1.5)
    print('Ну что? Что мы делаем?')
    time.sleep(1.5)
    print("1 –– Атакуем")
    print("2 –– Защищаемся")
    print("3 –– Бежим")
    k = int(input())
    if k == 1:
        print("Вы атакуете бомжа. Наверное, вы думали, что его побъете")
        time.sleep(1.5)
        print('Но бьет он вас..')
        time.sleep(1.5)
        if cat == True:
            print("НО ВДРУГ ПОЯВЛЯЕТСЯ ТОТ САМЫЙ КОТ, КОТОРОГО ВЫ ПОГЛАДИЛИ!")
            time.sleep(1.5)
            print('ฅ^•ﻌ•^ฅ meow')
            time.sleep(1.5)
            print("ОН НАПАДАЕТ НА БОМЖА")
            time.sleep(1.5)
            print('ฅ^•ﻌ•^ฅ meow ฅ^•ﻌ•^ฅ mEOW  ฅ^•ﻌ•^ฅ MEOWWWWWWWWWW')
            time.sleep(1.5)
            print("Он спасает вас! Ура! Вы выживаете.")
            ending()
        else:
            print("Вас избивает бомж. Вам больно. Вы погибаете.")
            time.sleep(1.5)
            print("Все плохо. Вы проиграли. В следующий играйте адекватнее :)")
    if k == 2:
        print('Вы решаете защищаться. И вы делаете это плохо')
        time.sleep(1.5)
        print('Вас бьет бомж.')
        if cat == True:
            print("НО ВДРУГ ПОЯВЛЯЕТСЯ ТОТ САМЫЙ КОТ, КОТОРОГО ВЫ ПОГЛАДИЛИ!")
            time.sleep(1.5)
            print('ฅ^•ﻌ•^ฅ meow')
            time.sleep(1.5)
            print("ОН НАПАДАЕТ НА БОМЖА")
            time.sleep(1.5)
            print('ฅ^•ﻌ•^ฅ meow ฅ^•ﻌ•^ฅ mEOW  ฅ^•ﻌ•^ฅ MEOWWWWWWWWWW')
            time.sleep(1.5)
            print("Он спасает вас! Ура! Вы выживаете.")
            ending()
        else:
            print("Вас избивает бомж. Вам больно. Вы погибаете.")
            print("Все плохо. Вы проиграли. В следующий играйте адекватнее :)")
            exit()
    if k == 3:
        print('Вы убежали от бомжа. Это похвально.')
        ending()
    else:
            print("Все плохо. Вы проиграли. В следующий играйте адекватнее :)")

def komnata():
    print("Вы заходите в комнату")
    time.sleep(2)
    print("Она пустая.")
    time.sleep(1.5)
    print('Вы, похоже, зря в нее зашли')
    time.sleep(1.5)
    print("А еще вы очень доверчивы.")
    time.sleep(2)
    print('( ͡° ͜ʖ ͡°)')
    time.sleep(2)
    print("Вы выходите из комнаты и направляетесь на улицу")
    time.sleep(2)
    print('Как вдруг... Из комнаты в которой вы очутились доносятся странные звуки.')
    time.sleep(1.5)
    print('Ну что? !НА УЛИЦУ! или в комнату?')
    time.sleep(1.5)
    print("1 ––  На улицу")
    print("2 –– В комнату")
    c3 = int(input())
    if c3 == 1:
        ulica()
    if c3 == 2:
        print("Вы заходите в комнату.")
        time.sleep(1.5)
        print("О, Кот! Привет!")
        time.sleep(2)
        print("Кот вам не отвечает.")
        time.sleep(2)
        print("Наверное потому-что коты не умеет говорить на человеческом")
        time.sleep(1.5)
        print("Погладим кота?")
        print("1 ––  Гладим")
        print("2 –– Не гладим")
        p = int(input())
        if p == 1:
            time.sleep(1.5)
            print('ฅ^•ﻌ•^ฅ meow')
            time.sleep(0.5)
            print('В этот раз вас ничего не останавливает и вы направляетесь к выходу.')
            global cat
            cat = True
            ulica()
        if p == 2:
            time.sleep(1.5)
            print('Вы чудовище.')
            time.sleep(1.5)
            print("Вы изверг.")
            time.sleep(1.5)
            print('Так нельзя.')
            time.sleep(1.5)
            print('Кот вас кусает.')
            time.sleep(1.5)
            print('Вам очень больно.')
            time.sleep(1.5)
            print('Вы совершили ошибку.')
            time.sleep(1.5)
            print('Вы совершили самую главную ошибку в жизни')
            time.sleep(1.5)
            print('Теперь живи с этим', name, '.')
            time.sleep(1.5)
            print('Ты проиграл, ', name, '.')
            time.sleep(1.5)
            exit()
if c2 == 1:
    cat = False
    ulica()
if c2 == 2:
    komnata()
